903257958/stm32_oop_driver/st7735_spi_hw_dma/driver/lcd.c
    DMA_ClearFlag(__lcd_get_dma_flag(dev->info.spix));
	
    DMA_Cmd(__lcd_get_dma_channel(dev->info.spix), DISABLE);
	
	#elif defined(STM32F40_41xxx)
	
    __lcd_config_dma_clock_enable(dev->info.spix);	// 开启DMA时钟
	
	DMA_DeInit(__lcd_get_dma_stream(dev->info.spix));
	DMA_InitTypeDef DMA_InitStructure;
    DMA_InitStructure.DMA_Channel = __lcd_get_dma_channel(dev->info.spix);		// 选择DMA通道
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&dev->info.spix->DR;	// SPI数据寄存器地址
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)g_lcd_display_buf;			// 内存地址
    DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;						// 方向：从内存到外设
    DMA_InitStructure.DMA_BufferSize = 0;										// 传输大小
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;			// 外设地址不增
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;						// 内存地址自增
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;		// 外设数据单位8位
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;				// 内存数据单位8位
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;								// 工作在正常模式，一次传输后自动结束
    DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;						// 优先级：中
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;						// 禁用FIFO模式
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;				// FIFO阈值为满
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;					// 内存突发传输为单次
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;			// 外设突发传输为单次
    DMA_Init(__lcd_get_dma_stream(dev->info.spix), &DMA_InitStructure);
	
    DMA_ClearFlag(	__lcd_get_dma_stream(dev->info.spix), 
					__lcd_get_dma_flag(dev->info.spix)	);
					
    DMA_Cmd(__lcd_get_dma_stream(dev->info.spix), DISABLE);
	
	#endif
}

/*通信协议*********************************************************************/

/******************************************************************************
 * @brief	LCD写RES高低电平
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	bitValue	:	要写入RES的电平值，范围：0/1
 * @return	无
 ******************************************************************************/
static void __lcd_res_write(LCDDev_t *dev, uint8_t bitValue)
{
	__lcd_io_write(dev->info.res_port, dev->info.res_pin, bitValue);
}

/******************************************************************************
 * @brief	LCD写DC高低电平
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	bitValue	:	要写入DC的电平值，范围：0/1
 * @return	无
 ******************************************************************************/
static void __lcd_dc_write(LCDDev_t *dev, uint8_t bitValue)
{
	__lcd_io_write(dev->info.dc_port, dev->info.dc_pin, bitValue);
}

/******************************************************************************
 * @brief	LCD写BL高低电平
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	bitValue	:	要写入DC的电平值，范围：0/1
 * @return	无
 ******************************************************************************/
static void __lcd_bl_write(LCDDev_t *dev, uint8_t bitValue)
{
	__lcd_io_write(dev->info.bl_port, dev->info.bl_pin, bitValue);
}

/******************************************************************************
 * @brief	LCD写命令
 * @param	dev	:	LCDDev_t 结构体指针
 * @param	byte	:	要写入的命令值，范围：0x00~0xFF
 * @return	无
 ******************************************************************************/
static void __lcd_write_command(LCDDev_t *dev, uint8_t command)
{
	__lcd_dc_write(dev, 0);			// 写命令
	__lcd_write_byte(dev, command);
	__lcd_dc_write(dev, 1);			// 写数据
}

/******************************************************************************
 * @brief	LCD写一个字节数据
 * @param	dev	:	LCDDev_t 结构体指针
 * @param	byte	:	要写入的数据，范围：0x00~0xFF
 * @return	无
 ******************************************************************************/
static void __lcd_write_byte(LCDDev_t *dev, uint8_t byte)
{	
	LCDPrivData_t *priv_data = (LCDPrivData_t *)dev->priv_data;
	
	priv_data->spi.start(&priv_data->spi);					// 拉低CS，开始通信
	priv_data->spi.swap_byte(&priv_data->spi, byte);		// 写入指定命令
	priv_data->spi.stop(&priv_data->spi);					// 拉高CS，结束通信
}

/******************************************************************************
 * @brief	LCD写一个半字数据
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	halfword	:	要写入的数据，范围：0x0000~0xFFFF
 * @return	无
 ******************************************************************************/
static void __lcd_write_halfword(LCDDev_t *dev, uint16_t halfword)
{
	LCDPrivData_t *priv_data = (LCDPrivData_t *)dev->priv_data;
	
	priv_data->spi.start(&priv_data->spi);						// 拉低CS，开始通信
	priv_data->spi.swap_byte(&priv_data->spi, halfword >> 8);	// 写入数据
	priv_data->spi.swap_byte(&priv_data->spi, halfword);		// 写入数据
	priv_data->spi.stop(&priv_data->spi);						// 拉高CS，结束通信
}

/**********************************************************************通信协议*/

/*硬件配置**********************************************************************/

/******************************************************************************
 * @brief	LCD设置起始和结束地址
 * @param	dev	:	LCDDev_t 结构体指针
 * @param	x1,x2	:	设置列的起始和结束地址
 * @param	y1,y2	:	设置行的起始和结束地址
 * @return	无
 ******************************************************************************/
static void __lcd_set_address(LCDDev_t *dev, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
	if(LCD_DIRECTION == 0 || LCD_DIRECTION == 1)			// 竖屏
	{
		__lcd_write_command(dev, 0x2a);					// 列地址设置
		__lcd_write_halfword(dev, x1 + 2);
		__lcd_write_halfword(dev, x2 + 2);
		__lcd_write_command(dev, 0x2b);					// 行地址设置
		__lcd_write_halfword(dev, y1 + 1);
		__lcd_write_halfword(dev, y2 + 1);
		__lcd_write_command(dev, 0x2c);					// 储存器写
	}
	else if(LCD_DIRECTION == 2 || LCD_DIRECTION == 3)		// 横屏
	{
		__lcd_write_command(dev, 0x2a);					// 列地址设置
		__lcd_write_halfword(dev, x1 + 1);
		__lcd_write_halfword(dev, x2 + 1);
		__lcd_write_command(dev, 0x2b);					// 行地址设置
		__lcd_write_halfword(dev, y1 + 2);
		__lcd_write_halfword(dev, y2 + 2);
		__lcd_write_command(dev, 0x2c);					// 储存器写
	}
}

/**********************************************************************硬件配置*/

/*工具函数**********************************************************************/

