903257958/stm32_oop_driver/st7735_spi_hw_dma/driver/lcd.c
/******************************************************************************
 * @brief	次方函数
 * @param	x	:	底数
 * @param	y	:	指数
 * @return	x^y
 ******************************************************************************/
static uint32_t __lcd_pow(uint32_t x, uint32_t y)
{
	uint32_t result = 1;	// 结果默认为1
	while (y --)			// 累乘y次
	{
		result *= x;		// 每次把x累乘到结果上
	}
	return result;
}

/**********************************************************************工具函数*/

/*功能函数**********************************************************************/

/******************************************************************************
 * @brief	LCD DMA传输更新显存
 * @param	dev	:	LCDDev_t 结构体指针
 * @return	无
 ******************************************************************************/
static void __lcd_update(LCDDev_t *dev)
{
	if(dev->info.use_dma == LCD_USE_DMA)
	{
		LCDPrivData_t *priv_data = (LCDPrivData_t *)dev->priv_data;
		
		/* 将整个数据搬运一次到DMA */
		__lcd_set_address(dev, 0, 0, LCD_W - 1, LCD_H - 1);
		
		/* 重新设置缓存大小，开启一次DMA传输 */
		#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
		
		DMA_Cmd(__lcd_get_dma_channel(dev->info.spix), DISABLE);							// 关闭DMA
		DMA_SetCurrDataCounter(__lcd_get_dma_channel(dev->info.spix), LCD_W * LCD_H * 2);	// 数据传输量
		DMA_ClearFlag(__lcd_get_dma_flag(dev->info.spix));
		
		priv_data->spi.cs_write(&priv_data->spi, 0);
		__lcd_res_write(dev, 1);
		
		SPI_I2S_DMACmd(dev->info.spix, SPI_I2S_DMAReq_Tx, ENABLE);							// 开启SPI的DMA接收
		DMA_Cmd(__lcd_get_dma_channel(dev->info.spix), ENABLE);							// 使能DMA
		
		while(!DMA_GetFlagStatus(__lcd_get_dma_flag(dev->info.spix)));						// 等待传输完成
		DMA_ClearFlag(__lcd_get_dma_flag(dev->info.spix));
		
		#elif defined(STM32F40_41xxx)
		
		DMA_Cmd(__lcd_get_dma_stream(dev->info.spix), DISABLE);							// 关闭DMA
		DMA_SetCurrDataCounter(__lcd_get_dma_stream(dev->info.spix), LCD_W * LCD_H * 2);	// 数据传输量
		
		DMA_ClearFlag(	__lcd_get_dma_stream(dev->info.spix), 
						__lcd_get_dma_flag(dev->info.spix)	);
		
		priv_data->spi.cs_write(&priv_data->spi, 0);
		__lcd_res_write(dev, 1);
		
		SPI_I2S_DMACmd(dev->info.spix, SPI_I2S_DMAReq_Tx, ENABLE);							// 开启SPI的DMA接收
		DMA_Cmd(__lcd_get_dma_stream(dev->info.spix), ENABLE);								// 使能DMA
		
		while(!DMA_GetFlagStatus(	__lcd_get_dma_stream(dev->info.spix), 					// 等待传输完成
									__lcd_get_dma_flag(dev->info.spix)		));
		
		DMA_ClearFlag(	__lcd_get_dma_stream(dev->info.spix),
						__lcd_get_dma_flag(dev->info.spix)	);
		
		#endif
		
		priv_data->spi.cs_write(&priv_data->spi, 1);
	}
}

/******************************************************************************
 * @brief	LCD填充颜色
 * @param	dev	:	LCDDev_t 结构体指针
 * @param	color	:	要填充的颜色
 * @return	无
 ******************************************************************************/
static void __lcd_fill(LCDDev_t *dev, uint16_t color)
{          
	uint16_t i, j;
	
	if(dev->info.use_dma == LCD_USE_DMA)
	{
		for(i = 0 ; i < LCD_H; i++)
		{
			for(j = 0;j < LCD_W * 2; j += 2)
			{
				g_lcd_display_buf[i][j] = color >> 8;
				g_lcd_display_buf[i][j + 1] = color;
			}
		}
	}
	else if(dev->info.use_dma == LCD_NONUSE_DMA)
	{
		__lcd_set_address(dev, 0, 0, LCD_W - 1, LCD_H - 1);// 设置显示范围
		for(i = 0; i < LCD_H; i++)
		{													   	 	
			for(j = 0; j < LCD_W; j++)
			{
				__lcd_write_halfword(dev, color);
			}
		}
	}
}

/******************************************************************************
 * @brief	LCD在指定区域填充颜色
 * @param	dev	:	LCDDev_t 结构体指针
 * @param	x,y		:	填充起点
 * @param	width	:	填充的宽度
 * @param	height	:	填充的高度
 * @param	color	:	要填充的颜色
 * @return	无
 ******************************************************************************/
static void __lcd_fill_area(LCDDev_t *dev, uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t color)
{          
	uint16_t i, j;
	
	if(dev->info.use_dma == LCD_USE_DMA)
	{
		for(i = y ; i < y + height; i++)
		{
			for(j = x * 2; j < (x + width) * 2; j += 2)
			{
				g_lcd_display_buf[i][j] = color >> 8;
				g_lcd_display_buf[i][j + 1] = color;
			}
		}
	}
	else if(dev->info.use_dma == LCD_NONUSE_DMA)
	{
		__lcd_set_address(dev, x, y, x + width - 1, y + height - 1);// 设置显示范围
		for(i = y; i < y + height; i++)
		{													   	 	
			for(j = x; j < x + width; j++)
			{
				__lcd_write_halfword(dev, color);
			}
		}
	}
}

/******************************************************************************
 * @brief	LCD显示单个字符
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x,y			:	显示坐标
 * @param	character	:	要显示的字符
 * @param	fc			:	字的颜色
 * @param	bc			:	字的背景色
 * @param	fontSize	:	指定字体大小
			范围		:	LCD_16X32	宽16像素，高32像素
							LCD_12X24	宽12像素，高24像素
							LCD_8X16	宽8像素，高16像素
							LCD_6X12	宽6像素，高12像素
 * @return	无
 ******************************************************************************/
static void __lcd_show_char(LCDDev_t *dev, uint16_t x, uint16_t y, uint8_t character, uint16_t fc, uint16_t bc, uint8_t fontSize)
{
	uint8_t temp, fontSizex, t, m = 0;
	uint16_t i, TypefaceNum;										//一个字符所占字节大小
	uint16_t x0 = x;
	fontSizex = fontSize / 2;
	TypefaceNum = (fontSizex / 8 + ((fontSizex % 8) ? 1 : 0)) * fontSize;
	character = character - ' ';    								//得到偏移后的值
	__lcd_set_address(dev, x, y, x+fontSizex - 1, y+fontSize - 1);	//设置光标位置 
	for(i = 0; i < TypefaceNum; i++)
	{ 
		if(fontSize == 12)		temp=LCD_F6x12[character][i];		//调用6x12字体
		else if(fontSize == 16)	temp=LCD_F8x16[character][i];		//调用8x16字体
		else if(fontSize == 24)	temp=LCD_F12x24[character][i];		//调用12x24字体
		else if(fontSize == 32)	temp=LCD_F16x32[character][i];		//调用16x32字体
		else return;
		for(t = 0; t < 8; t++)
		{
			if(dev->info.use_dma == LCD_USE_DMA)
			{
				if(temp & (0x01 << t))__lcd_draw_point(dev, x, y, fc);//画一个点
				else __lcd_draw_point(dev, x, y, bc);
				x++;
				if((x - x0) == fontSizex)
				{
					x = x0;
					y++;
					break;
				}
			}
			else if(dev->info.use_dma == LCD_NONUSE_DMA)
			{
				if(temp & (0x01 << t))__lcd_write_halfword(dev, fc);
				else __lcd_write_halfword(dev, bc);
				m++;
				if(m % fontSizex == 0)
				{
					m = 0;
					break;
				}
			}
		}
	}   	 	  
}

