903257958/stm32_oop_driver/st7735_spi_hw_dma/driver/lcd.c
/******************************************************************************
 * @brief	LCD显示字符串
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x,y			:	显示坐标
 * @param	string		:	要显示的字符串
 * @param	fc			:	字的颜色
 * @param	bc			:	字的背景色
 * @param	fontSize	:	指定字体大小
			范围		:	LCD_16X32	宽16像素，高32像素
							LCD_12X24	宽12像素，高24像素
							LCD_8X16	宽8像素，高16像素
							LCD_6X12	宽6像素，高12像素
 * @return	无
 ******************************************************************************/
static void __lcd_show_string(LCDDev_t *dev, uint16_t x, uint16_t y, char *string, uint16_t fc, uint16_t bc, uint8_t fontSize)
{         
	while(*string!='\0')
	{       
		__lcd_show_char(dev, x, y, *string, fc, bc, fontSize);
		x += fontSize / 2;
		string++;
	}
}

/******************************************************************************
 * @brief	LCD显示整数变量
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x,y			:	显示坐标
 * @param	num			:	要显示整数变量
 * @param	len			:	要显示的位数
 * @param	fc			:	字的颜色
 * @param	bc			:	字的背景色
 * @param	fontSize	:	指定字体大小
			范围		:	LCD_16X32	宽16像素，高32像素
							LCD_12X24	宽12像素，高24像素
							LCD_8X16	宽8像素，高16像素
							LCD_6X12	宽6像素，高12像素
 * @return	无
 ******************************************************************************/
static void __lcd_show_num(LCDDev_t *dev, uint16_t x, uint16_t y, uint32_t num, uint8_t len, uint16_t fc, uint16_t bc, uint8_t fontSize)
{         	
	uint8_t t, temp;
	uint8_t enshow = 0;
	uint8_t fontSizex = fontSize / 2;
	for(t = 0; t < len; t++)
	{
		temp = (num / __lcd_pow(10, len - t - 1)) % 10;
		if(enshow == 0 && t < (len - 1))
		{
			if(temp == 0)
			{
				__lcd_show_char(dev, x + t * fontSizex, y, ' ', fc, bc, fontSize);
				continue;
			}else enshow = 1; 
		 	 
		}
	 	__lcd_show_char(dev, x + t * fontSizex, y, temp + 48, fc, bc, fontSize);
	}
}

/******************************************************************************
 * @brief	LCD显示两位小数变量
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x		:	x坐标
 * @param	y		:	y坐标
 * @param	num		:	要显示整数变量
 * @param	int_len	:	要显示的整数位数
 * @param	fra_len	:	要显示的小数位数
 * @param	fc		:	字的颜色
 * @param	bc		:	字的背景色
 * @param	size	:	指定字体大小：LCD_16X32 / LCD_12X24 / LCD_8X16 / LCD_6X12
 * @param	mode	:	模式：0非叠加/1叠加
 * @return	无
 ******************************************************************************/
static void __lcd_show_float_num(LCDDev_t *dev, uint16_t x, uint16_t y, float num, uint8_t int_len, uint8_t fra_len, uint16_t fc, uint16_t bc, uint8_t size)
{
    uint32_t powNum, intNum, fraNum;
	
	if (num < 0)
	{
		__lcd_show_char(dev, x, y, '-', fc, bc, size);	// 显示-号
	}
	
	/* 提取整数部分和小数部分 */
	intNum = num;						// 直接赋值给整型变量，提取整数
	num -= intNum;						// 将Number的整数减掉，防止之后将小数乘到整数时因数过大造成错误
	powNum = __lcd_pow(10, fra_len);		// 根据指定小数的位数，确定乘数
	fraNum = round(num * powNum);		// 将小数乘到整数，同时四舍五入，避免显示误差
	intNum += fraNum / powNum;			// 若四舍五入造成了进位，则需要再加给整数
	
	if (num >= 0)
	{
		__lcd_show_num(dev, x, y, intNum, int_len, fc, bc, size);								// 显示整数部分
		__lcd_show_char(dev, x + (int_len) * size / 2, y, '.', fc, bc, size);					// 显示小数点
		__lcd_show_num(dev, x + (int_len + 1) * size / 2, y, fraNum, fra_len, fc, bc, size);		// 显示小数部分
	}
	else
	{
		num = -num;
		__lcd_show_num(dev, x + size / 2, y, intNum, int_len, fc, bc, size);					// 显示整数部分
		__lcd_show_char(dev, x + (int_len + 1) * size / 2, y, '.', fc, bc, size);				// 显示小数点
		__lcd_show_num(dev, x + (int_len + 2) * size / 2, y, fraNum, fra_len, fc, bc, size);		// 显示小数部分
	}
}

/******************************************************************************
 * @brief	LCD显示单个12x12汉字
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x,y			:	显示坐标
 * @param	Chinese		:	要显示的汉字
 * @param	fc			:	字的颜色
 * @param	bc			:	字的背景色
 * @param	fontSize	:	指定字体大小
			范围		:	LCD_32X32	宽32像素，高32像素
							LCD_24X24	宽24像素，高24像素
							LCD_16X16	宽16像素，高16像素
							LCD_12X12	宽12像素，高12像素
 * @return	无
 ******************************************************************************/
static void __lcd_show_chinese12x12(LCDDev_t *dev, uint16_t x, uint16_t y, char *Chinese, uint16_t fc, uint16_t bc)
{
	uint8_t i, j, m = 0;
	uint16_t k;
	uint16_t ChineseNum = GetChineseNum(12); 					//汉字数目
	uint16_t TypefaceNum = (12 / 8 + ((12 % 8) ? 1 : 0)) * 12;	//一个字符所占字节大小
	uint16_t x0 = x;
	
	for (k = 0; k < ChineseNum; k++)
	{
		if ((LCD_CF12x12[k].Index[0] == *(Chinese)) && (LCD_CF12x12[k].Index[1] == *(Chinese + 1)))
		{
			__lcd_set_address(dev, x, y, x + 12 - 1, y + 12 - 1);
			for (i = 0; i < TypefaceNum; i++)
			{
				for (j = 0; j < 8; j++)
				{
					if(dev->info.use_dma == LCD_USE_DMA)
					{
						if (LCD_CF12x12[k].Msk[i] & (0x01 << j))
							__lcd_draw_point(dev, x, y, fc); //画一个点
						else
							__lcd_draw_point(dev, x, y, bc);
						x++;
						if ((x - x0) == 12)
						{
							x = x0;
							y++;
							break;
						}
					}
					else if(dev->info.use_dma == LCD_NONUSE_DMA)
					{
						if (LCD_CF12x12[k].Msk[i] & (0x01 << j))
							__lcd_write_halfword(dev, fc);
						else
							__lcd_write_halfword(dev, bc);
						m++;
						if (m % 12 == 0)
						{
							m = 0;
							break;
						}
					}
				}
			}
		}
		continue; //查找到对应点阵字库立即退出，防止多个汉字重复取模带来影响
	}
}

/******************************************************************************
 * @brief	LCD显示单个16x16汉字
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x,y			:	显示坐标
 * @param	Chinese		:	要显示的汉字
 * @param	fc			:	字的颜色
 * @param	bc			:	字的背景色
 * @param	fontSize	:	指定字体大小
			范围		:	LCD_32X32	宽32像素，高32像素
							LCD_24X24	宽24像素，高24像素
							LCD_16X16	宽16像素，高16像素
							LCD_12X12	宽12像素，高12像素
 * @return	无
 ******************************************************************************/
static void __lcd_show_chinese16x16(LCDDev_t *dev, uint16_t x, uint16_t y, char *Chinese, uint16_t fc, uint16_t bc)
{
	uint8_t i, j, m = 0;
	uint16_t k;
	uint16_t ChineseNum = GetChineseNum(16); 					//汉字数目
	uint16_t TypefaceNum = (16 / 8 + ((16 % 8) ? 1 : 0)) * 16;	//一个字符所占字节大小
	uint16_t x0 = x;
	
	for (k = 0; k < ChineseNum; k++)
	{
		if ((LCD_CF16x16[k].Index[0] == *(Chinese)) && (LCD_CF16x16[k].Index[1] == *(Chinese + 1)))
		{
			__lcd_set_address(dev, x, y, x + 16 - 1, y + 16 - 1);
			for (i = 0; i < TypefaceNum; i++)
			{
				for (j = 0; j < 8; j++)
				{
					if(dev->info.use_dma == LCD_USE_DMA)
					{
						if (LCD_CF16x16[k].Msk[i] & (0x01 << j))
							__lcd_draw_point(dev, x, y, fc); //画一个点
						else
							__lcd_draw_point(dev, x, y, bc);
						x++;
						if ((x - x0) == 16)
						{
							x = x0;
							y++;
							break;
						}
					}
					else if(dev->info.use_dma == LCD_NONUSE_DMA)
					{
						if (LCD_CF16x16[k].Msk[i] & (0x01 << j))
							__lcd_write_halfword(dev, fc);
						else
							__lcd_write_halfword(dev, bc);
						m++;
						if (m % 16 == 0)
						{
							m = 0;
							break;
						}
					}
				}
			}
		}
		continue; //查找到对应点阵字库立即退出，防止多个汉字重复取模带来影响
	}
}

