903257958/stm32_oop_driver/st7735_spi_hw_dma/driver/lcd.c
/******************************************************************************
 * @brief	LCD显示单个24x24汉字
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x,y			:	显示坐标
 * @param	Chinese		:	要显示的汉字
 * @param	fc			:	字的颜色
 * @param	bc			:	字的背景色
 * @param	fontSize	:	指定字体大小
			范围		:	LCD_32X32	宽32像素，高32像素
							LCD_24X24	宽24像素，高24像素
							LCD_16X16	宽16像素，高16像素
							LCD_12X12	宽12像素，高12像素
 * @return	无
 ******************************************************************************/
static void __lcd_show_chinese24x24(LCDDev_t *dev, uint16_t x, uint16_t y, char *Chinese, uint16_t fc, uint16_t bc)
{
	uint8_t i, j, m = 0;
	uint16_t k;
	uint16_t ChineseNum = GetChineseNum(24); 					//汉字数目
	uint16_t TypefaceNum = (24 / 8 + ((24 % 8) ? 1 : 0)) * 24;	//一个字符所占字节大小
	uint16_t x0 = x;
	
	for (k = 0; k < ChineseNum; k++)
	{
		if ((LCD_CF24x24[k].Index[0] == *(Chinese)) && (LCD_CF24x24[k].Index[1] == *(Chinese + 1)))
		{
			__lcd_set_address(dev, x, y, x + 24 - 1, y + 24 - 1);
			for (i = 0; i < TypefaceNum; i++)
			{
				for (j = 0; j < 8; j++)
				{
					if(dev->info.use_dma == LCD_USE_DMA)
					{
						if (LCD_CF24x24[k].Msk[i] & (0x01 << j))
							__lcd_draw_point(dev, x, y, fc); //画一个点
						else
							__lcd_draw_point(dev, x, y, bc);
						x++;
						if ((x - x0) == 24)
						{
							x = x0;
							y++;
							break;
						}
					}
					else if(dev->info.use_dma == LCD_NONUSE_DMA)
					{
						if (LCD_CF24x24[k].Msk[i] & (0x01 << j))
							__lcd_write_halfword(dev, fc);
						else
							__lcd_write_halfword(dev, bc);
						m++;
						if (m % 24 == 0)
						{
							m = 0;
							break;
						}
					}
				}
			}
		}
		continue; //查找到对应点阵字库立即退出，防止多个汉字重复取模带来影响
	}
}

/******************************************************************************
 * @brief	LCD显示单个32x32汉字
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x,y			:	显示坐标
 * @param	Chinese		:	要显示的汉字
 * @param	fc			:	字的颜色
 * @param	bc			:	字的背景色
 * @param	fontSize	:	指定字体大小
			范围		:	LCD_32X32	宽32像素，高32像素
							LCD_24X24	宽24像素，高24像素
							LCD_16X16	宽16像素，高16像素
							LCD_12X12	宽12像素，高12像素
 * @return	无
 ******************************************************************************/
static void __lcd_show_chinese32x32(LCDDev_t *dev, uint16_t x, uint16_t y, char *Chinese, uint16_t fc, uint16_t bc)
{
		uint8_t i, j, m = 0;
	uint16_t k;
	uint16_t ChineseNum = GetChineseNum(32); 					//汉字数目
	uint16_t TypefaceNum = (32 / 8 + ((32 % 8) ? 1 : 0)) * 32;	//一个字符所占字节大小
	uint16_t x0 = x;
	
	for (k = 0; k < ChineseNum; k++)
	{
		if ((LCD_CF32x32[k].Index[0] == *(Chinese)) && (LCD_CF32x32[k].Index[1] == *(Chinese + 1)))
		{
			__lcd_set_address(dev, x, y, x + 32 - 1, y + 32 - 1);
			for (i = 0; i < TypefaceNum; i++)
			{
				for (j = 0; j < 8; j++)
				{
					if(dev->info.use_dma == LCD_USE_DMA)
					{
						if (LCD_CF32x32[k].Msk[i] & (0x01 << j))
							__lcd_draw_point(dev, x, y, fc); //画一个点
						else
							__lcd_draw_point(dev, x, y, bc);
						x++;
						if ((x - x0) == 32)
						{
							x = x0;
							y++;
							break;
						}
					}
					else if(dev->info.use_dma == LCD_NONUSE_DMA)
					{
						if (LCD_CF32x32[k].Msk[i] & (0x01 << j))
							__lcd_write_halfword(dev, fc);
						else
							__lcd_write_halfword(dev, bc);
						m++;
						if (m % 32 == 0)
						{
							m = 0;
							break;
						}
					}
				}
			}
		}
		continue; //查找到对应点阵字库立即退出，防止多个汉字重复取模带来影响
	}
}

/******************************************************************************
 * @brief	LCD显示汉字串
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x,y			:	显示坐标
 * @param	Chinese		:	要显示的汉字串
 * @param	fc			:	字的颜色
 * @param	bc			:	字的背景色
 * @param	fontSize	:	指定字体大小
			范围		:	LCD_32X32	宽32像素，高32像素
							LCD_24X24	宽24像素，高24像素
							LCD_16X16	宽16像素，高16像素
							LCD_12X12	宽12像素，高12像素
 * @return	无
 ******************************************************************************/
static void __lcd_show_chinese(LCDDev_t *dev, uint16_t x, uint16_t y, char *Chinese, uint16_t fc, uint16_t bc, uint8_t fontSize)
{
	while(*Chinese != 0)
	{
		if(fontSize==LCD_12X12)			__lcd_show_chinese12x12(dev, x, y, Chinese, fc, bc);
		else if(fontSize==LCD_16X16)	__lcd_show_chinese16x16(dev, x, y, Chinese, fc, bc);
		else if(fontSize==LCD_24X24)	__lcd_show_chinese24x24(dev, x, y, Chinese, fc, bc);
		else if(fontSize==LCD_32X32)	__lcd_show_chinese32x32(dev, x, y, Chinese, fc, bc);
		else return;
		
		Chinese += LCD_CHN_CHAR_WIDTH;
		x += fontSize;
	}
}

/******************************************************************************
 * @brief	LCD显示图片
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x,y			:	起点坐标
 * @param	width		:	图片宽度
 * @param	height		:	图片高度
 * @param	pic[]		:	图片数组
 * @return	无
 ******************************************************************************/
static void __lcd_show_image(LCDDev_t *dev, uint16_t x, uint16_t y, uint16_t width, uint16_t height, const uint8_t pic[])
{
	uint16_t i, j; 
	uint32_t k = 0;
	
	if(dev->info.use_dma == LCD_USE_DMA)
	{
		for(i = y; i < y + height; i++)
		{
			for(j = x; j < x + width; j++)
			{
				g_lcd_display_buf[i][j * 2] = pic[k * 2];
                g_lcd_display_buf[i][j * 2 + 1] = pic[k * 2 + 1];
				k++;
			}
		}
	}
	else if(dev->info.use_dma == LCD_NONUSE_DMA)
	{
		__lcd_set_address(dev, x, y, x + width - 1, y + height - 1);	//设置显示范围
		for(i = 0; i < height; i++)
		{													   	 	
			for(j = 0; j < width; j++)
			{
				__lcd_write_byte(dev, pic[k * 2]);
				__lcd_write_byte(dev, pic[k * 2 + 1]);
				k++;
			}
		}
	}
}

/******************************************************************************
 * @brief	LCD在指定位置画点
 * @param	dev	:	LCDDev_t 结构体指针
 * @param	x,y		:	画点坐标
 * @param	color	:	点的颜色
 * @return	无
 ******************************************************************************/
static void __lcd_draw_point(LCDDev_t *dev, uint16_t x, uint16_t y, uint16_t color)
{
	if(dev->info.use_dma == LCD_USE_DMA)
	{
		/*使用DMA的话，从对点刷屏到对显存数组写入数据，DMA传输数据的时候再统一进行传输*/
		g_lcd_display_buf[y][x*2] = color >> 8;
		g_lcd_display_buf[y][x*2+1] = color;
	}
	else if(dev->info.use_dma == LCD_NONUSE_DMA)
	{
		__lcd_set_address(dev, x, y, x, y);		//设置光标位置 
		__lcd_write_halfword(dev, color);
	}
}

