903257958/stm32_oop_driver/st7735_spi_hw_dma/driver/lcd.c
/******************************************************************************
 * @brief	LCD画线
 * @param	dev	:	LCDDev_t 结构体指针
 * @param	x1,y1	:	起始坐标
 * @param	x2,y2	:	终止坐标
 * @param	color	:	线的颜色
 * @return	无
 ******************************************************************************/
static void __lcd_draw_line(LCDDev_t *dev, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t color)
{
	uint16_t t; 
	int xerr = 0, yerr = 0, delta_x, delta_y, distance;
	int incx, incy, uRow, uCol;
	
	/*计算坐标增量*/
	delta_x = x2 - x1; 
	delta_y = y2 - y1;
	
	/*画线起点坐标*/
	uRow = x1;
	uCol = y1;
	
	/*设置单步方向 */
	if(delta_x > 0)
		incx = 1; 
	else if (delta_x == 0)	//垂直线 
		incx = 0;
	else
	{
		incx = -1;
		delta_x = -delta_x;
	}
	
	if(delta_y > 0)
		incy = 1;
	else if (delta_y == 0)	//水平线
		incy = 0; 
	else
	{
		incy = -1;
		delta_y = -delta_y;
	}
	
	/*选取基本增量坐标轴*/
	if(delta_x > delta_y)
		distance = delta_x;
	else
		distance = delta_y;
	
	/*画点*/
	for(t = 0; t < distance + 1; t++)
	{
		__lcd_draw_point(dev, uRow, uCol, color);
		xerr += delta_x;
		yerr += delta_y;
		if(xerr > distance)
		{
			xerr -= distance;
			uRow += incx;
		}
		if(yerr > distance)
		{
			yerr -= distance;
			uCol += incy;
		}
	}
}

/******************************************************************************
 * @brief	LCD画矩形
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x			:	指定矩形左上角的横坐标
 * @param	y			:	指定矩形左上角的纵坐标
 * @param	width		:	指定矩形的宽度
 * @param	height		:	指定矩形的高度
 * @param	color		:	矩形的颜色
 * @param	is_filled	:	指定是否填充
 * @return	无
 ******************************************************************************/
static void __lcd_draw_rectangle(LCDDev_t *dev, uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t color, uint8_t is_filled)
{
	uint8_t i, j;
	if (!is_filled)		//指定矩形不填充
	{
		/*遍历上下x坐标，画矩形上下两条线*/
		for (i = x; i < x + width; i ++)
		{
			__lcd_draw_point(dev, i, y, color);
			__lcd_draw_point(dev, i, y + height - 1, color);
		}
		/*遍历左右y坐标，画矩形左右两条线*/
		for (i = y; i < y + height; i ++)
		{
			__lcd_draw_point(dev, x, i, color);
			__lcd_draw_point(dev, x + width - 1, i, color);
		}
	}
	else				//指定矩形填充
	{
		/*遍历x坐标*/
		for (i = x; i < x + width; i ++)
		{
			/*遍历y坐标*/
			for (j = y; j < y + height; j ++)
			{
				/*在指定区域画点，填充满矩形*/
				__lcd_draw_point(dev, i, j, color);
			}
		}
	}
}

/******************************************************************************
 * @brief	LCD画圆
 * @param	dev	:	LCDDev_t 结构体指针
 * @param	x,y	:	圆心坐标
 * @param	radius	:	半径
 * @param	color	:	圆的颜色
 * @return	无
 ******************************************************************************/
static void __lcd_draw_circle(LCDDev_t *dev, uint16_t x, uint16_t y, uint8_t radius, uint16_t color)
{
	int a, b;
	a = 0;
	b = radius;
	
	while(a <= b)
	{
		__lcd_draw_point(dev, x - b, y - a, color);	//3           
		__lcd_draw_point(dev, x + b, y - a, color);	//0           
		__lcd_draw_point(dev, x - a, y + b, color);	//1                
		__lcd_draw_point(dev, x - a, y - b, color);	//2             
		__lcd_draw_point(dev, x + b, y + a, color);	//4               
		__lcd_draw_point(dev, x + a, y - b, color);	//5
		__lcd_draw_point(dev, x + a, y + b, color);	//6 
		__lcd_draw_point(dev, x - b, y + a, color);	//7
		a++;
		if((a * a + b * b) > (radius * radius))		//判断要画的点是否过远
		{
			b--;
		}
	}
}

/******************************************************************************
 * @brief	去初始化LCD
 * @param	dev   :  OLEDDev_t结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __lcd_deinit(LCDDev_t *dev)
{
	if (!dev || !dev->init_flag)
	return -1;
	
	LCDPrivData_t *priv_data = (LCDPrivData_t *)dev->priv_data;
	
	/*去初始化硬件SPI*/
	priv_data->spi.deinit(&priv_data->spi);
	
	/*释放私有数据内存*/
	free(dev->priv_data);
	dev->priv_data = NULL;
	
	dev->init_flag = false;	//修改初始化标志
	return 0;
}

/**********************************************************************功能函数*/
